#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВКМ. Добавление группы ПериодДействия
		ГруппаПериодДействия = Элементы.Вставить("ВКМ_ГруппаПериодДействия", Тип("ГруппаФормы"), ЭтотОбъект, );
		ГруппаПериодДействия.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			ГруппаПериодДействия.Видимость = Истина;
		Иначе
			ГруппаПериодДействия.Видимость = Ложь;
		КонецЕсли;
	
	//ВКМ. Добавление поля ДатаНачалаДействияДоговора
		ПолеВводаДатаНачалаДействияДоговора = Элементы.Вставить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), Элементы.ВКМ_ГруппаПериодДействия, );
		ПолеВводаДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		ПолеВводаДатаНачалаДействияДоговора.Заголовок = "Дата начала действия договора";
				
	//ВКМ. Добавление поля ДатаОкончанияДействияДоговора
		ПолеВводаДатаОкончанияДействияДоговора = Элементы.Вставить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), Элементы.ВКМ_ГруппаПериодДействия, );
		ПолеВводаДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		ПолеВводаДатаОкончанияДействияДоговора.Заголовок = "Дата окончания действия договора";
			
	//ВКМ. Добавление поля СуммаАбонентскойПлаты	
		ПолеВводаСуммаАбонентскойПлаты = Элементы.Вставить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ,);
		ПолеВводаСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		ПолеВводаСуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
				
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			ПолеВводаСуммаАбонентскойПлаты.Видимость = Истина;
		Иначе
			ПолеВводаСуммаАбонентскойПлаты.Видимость = Ложь;
		КонецЕсли;
			
	//ВКМ. Добавление поля СтоимостьЧасаРаботыСпециалиста
		ПолеВводаСтоимостьЧасаРаботыСпециалиста = Элементы.Вставить("ВКМ_СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"), ,);
		ПолеВводаСтоимостьЧасаРаботыСпециалиста.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаСтоимостьЧасаРаботыСпециалиста.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
		ПолеВводаСтоимостьЧасаРаботыСпециалиста.Заголовок = "Стоимость часа работы специалиста";
				
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			ПолеВводаСтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
		Иначе
			ПолеВводаСтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
		КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	//ВКМ. Видимость полей при изменении вида договора
		Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			Элементы.ВКМ_ГруппаПериодДействия.Видимость = Истина;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
			Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
		Иначе
			Элементы.ВКМ_ГруппаПериодДействия.Видимость = Ложь;
			Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
			Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
		КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

