#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	
//ВКМ

	ВКМ_ЗаполнитьНаСервере();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обработка завершена!";
	Сообщение.Сообщить();
		
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ЗаполнитьНаСервере()
	
//ВКМ

	ОбработкаОбъект =  РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(ВКМ_ВыборПериода.ДатаНачала, ВКМ_ВыборПериода.ДатаОкончания, ВКМ_ВыходныеДни);
    
КонецПроцедуры

#КонецОбласти