#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СозданиеСпискаНаСервере(Дата, СоздатьРеализацию) Экспорт
	
//ВКМ
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	&Дата
	|		МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Реализация
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договор.Ссылка КАК Договор,
	|	ВТ_Реализация.Ссылка КАК Реализация,
	|	ВТ_Договор.Организация,
	|	ВТ_Договор.Контрагент
	|ИЗ
	|	ВТ_Договор КАК ВТ_Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
	|		ПО ВТ_Договор.Ссылка = ВТ_Реализация.Договор";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	МассивРеализаций = Новый Массив;
	
	Пока Результат.Следующий() Цикл
		РеализацииСтруктура = Новый Структура;
		Если СоздатьРеализацию Тогда
			Если НЕ ЗначениеЗаполнено(Результат.Реализация) Тогда
				НоваяРеализация = СозданиеРеализации(Результат, КонецМесяца(Дата));
				РеализацииСтруктура.Вставить("Договор", Результат.Договор);
				РеализацииСтруктура.Вставить("Реализация", НоваяРеализация);
			Иначе
				РеализацииСтруктура.Вставить("Договор", Результат.Договор);
				РеализацииСтруктура.Вставить("Реализация", Результат.Реализация);
			КонецЕсли;
		Иначе
			РеализацииСтруктура.Вставить("Договор", Результат.Договор);
			РеализацииСтруктура.Вставить("Реализация", Результат.Реализация);
		КонецЕсли;
			
			МассивРеализаций.Добавить(РеализацииСтруктура);
			
	КонецЦикла;
	
	Возврат МассивРеализаций;				
	
КонецФункции

Функция СозданиеРеализации(Результат, Дата)
	
//ВКМ
	
	РеализацияНовый = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	РеализацияНовый.Дата = Дата;
	РеализацияНовый.Договор = Результат.Договор;
	РеализацияНовый.Контрагент = Результат.Контрагент;
	РеализацияНовый.Организация = Результат.Организация;
	РеализацияНовый.ВыполнитьАвтозаполнение();
	РеализацияНовый.Основание = Документы.ЗаказПокупателя.ПустаяСсылка();
	РеализацияНовый.Ответственный = Пользователи.ТекущийПользователь();
	
	Если РеализацияНовый.ПроверитьЗаполнение() Тогда
		Попытка
			НачатьТранзакцию();
			РеализацияНовый.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ");
			ЗаписьЖурналаРегистрации("ОБРАБОТКА: Не удалось массово создать акты");
		КонецПопытки;
		
	Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не создана реализация по договору № %1. Не все поля заполнены", Результат.Договор));
	КонецЕсли;
	
	Возврат РеализацияНовый.Ссылка;

КонецФункции

#КонецОбласти

#КонецЕсли