#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	
//ВКМ
	
	ВКМ_ЗаполнитьНасервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&Насервере
Процедура ВКМ_ЗаполнитьНасервере()
	
//ВКМ
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник,
	|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток) КАК ВКМ_СуммаОстаток,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_ВидРасчета
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_ВидРасчета";
	
	Период = Новый Граница(Объект.Дата, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Период", Период);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Объект.ВКМ_Выплаты.Очистить();
	
	Пока Результат.Следующий() Цикл
		
		Строка = Объект.ВКМ_Выплаты.Добавить();
		Строка.ВКМ_Сотрудник = Результат.ВКМ_Сотрудник;
		Строка.ВКМ_Сумма = Результат.ВКМ_СуммаОстаток;
		Строка.ВКМ_ВидРасчета = Результат.ВКМ_ВидРасчета;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти