#Область ПрограммныйИнтерфейс

//Работа с Телеграм-ботом
Процедура ТелеграмУведомление() Экспорт
	
	//ВКМ
	
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);
	
	Ресурс = "bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage";
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ВКМ_ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Пока Результат.Следующий() Цикл
		
		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", ИдентификаторГруппыДляОповещения);
		Сообщение.Вставить("text", Результат.ТекстСообщения);
		
		СтрокаJSON = СтрокаJSON(Сообщение);
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		//@skip-check bsl-legacy-check-dynamic-feature-access
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Строка = Результат.Ссылка.ПолучитьОбъект();
			Строка.Удалить();
		Иначе
			Ошибка = ИнформацияОбОшибке();
			
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка));
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаJSON(ОбъектJSON)
	
//ВКМ
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
	
	Возврат Запись.Закрыть();
	
КонецФункции

#КонецОбласти