#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//ВКМ
	
	Адрес = Параметры.АдресВХранилище;
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.ВКМ_Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
		Точка.Текст = Строка.ВКМ_Сотрудник;
		Серия.Текст = "Отпуск";
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ВКМ_ДатаНачала;
		Интервал.Конец = Строка.ВКМ_ДатаОкончания;
		
		СтрокаТаблицы = Объект.ВКМ_ОтпускаСотрудников.Добавить();
		СтрокаТаблицы.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
		СтрокаТаблицы.ВКМ_ДатаНачала = Строка.ВКМ_ДатаНачала;
		СтрокаТаблицы.ВКМ_ДатаОкончания = Строка.ВКМ_ДатаОкончания;
		
		КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти
